app/Http/Controllers/DancesController.php

select * from `dances`
---
    public function store(Request $request)
    {
        if (auth()->guest()) {
            flash("vous devez etre membre et connecté pour acceder à cette page")->error();
            return redirect('/');
        }
        $dances=Dances::all();